src/Documents/ОбменВалюты/ОбменВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбменВалюты</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВалютаИз</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВ</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоКурсу</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КурсКоммерческийПокупка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсКоммерческийПродажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Гривна</name>
      <description>Гривна</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>Доллар</description>
    </items>
    <items>
      <name>Евро</name>
      <description>Евро</description>
    </items>
  </predefined>
  <attributes>
    <name>КодЧисловой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСимвольный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ОбменВалюты/ManagerModule.bsl
Функция Проведение ( Данные ) Экспорт
	
	получитьДанныеДокумента ( Данные );
	записатьКурс ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанныеДокумента ( Данные )
	
	текст = "
	|// ~Шапка
	|выбрать
	|	Дата как Период, ВалютаИз как ВалютаИз, ВалютаВ как ВалютаВ,
	|	Сумма как Сумма, СуммаПоКурсу как СуммаПоКурсу, Курс как Курс
	|из Документ.ОбменВалюты
	|где Ссылка = &Ссылка
	|;
	|выбрать
	|	Курс как Курс, КурсКоммерческийПокупка как КурсКоммерческийПокупка,
	|	КурсКоммерческийПродажа как КурсКоммерческийПродажа
	|из
	|	РегистрСведений.КурсыВалют.СрезПоследних ( &Дата, Валюта = значение ( Справочник.Валюты.Доллар ) )  
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	запрос.УстановитьПараметр ( "Дата", Данные.Дата );
	результат = запрос.ВыполнитьПакет ();
	выборкаШапка = результат [ 0 ].Выбрать ();
	выборкаШапка.Следующий ();
	Данные.Вставить ( "Шапка", выборкаШапка );
	выборкаКурсы = результат [ 1 ].Выбрать ();
	выборкаКурсы.Следующий ();
	Данные.Вставить ( "Курсы", выборкаКурсы );

КонецПроцедуры

Процедура записатьКурс ( Данные )
	
	Если ( Данные.Шапка.ВалютаИз = Данные.Шапка.ВалютаВ ) Тогда
		Возврат;
	КонецЕсли; 
	набор = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей ();
	набор.Отбор.Валюта.Установить ( Справочники.Валюты.Доллар );
	набор.Отбор.Период.Установить ( Данные.Шапка.Период );
	набор.Прочитать ();
	Если ( набор.Количество () = 0 ) Тогда
		новыйКурс = набор.Добавить ();
		новыйКурс.Период = Данные.Шапка.Период;
		новыйКурс.Валюта = Справочники.Валюты.Доллар;
		новыйКурс.Курс = Данные.Курсы.Курс;
		Если ( Данные.Шапка.ВалютаИз = Справочники.Валюты.Гривна ) Тогда // обмен грн.-> доллар
			новыйКурс.КурсКоммерческийПокупка = Данные.Шапка.Курс;
			новыйКурс.КурсКоммерческийПродажа = Данные.Курсы.КурсКоммерческийПродажа;
		Иначе // обмен доллар -> грн.
			новыйКурс.КурсКоммерческийПокупка = Данные.Курсы.КурсКоммерческийПокупка;;
			новыйКурс.КурсКоммерческийПродажа = Данные.Шапка.Курс;
		КонецЕсли; 
	Иначе
		курс = набор [ 0 ];
		Если ( Данные.Шапка.ВалютаИз = Справочники.Валюты.Гривна ) Тогда // обмен грн.-> доллар
			курс.КурсКоммерческийПокупка = Данные.Шапка.Курс;
			курс.КурсКоммерческийПродажа = Данные.Курсы.КурсКоммерческийПродажа;
		Иначе // обмен доллар -> грн.
			курс.КурсКоммерческийПокупка = Данные.Курсы.КурсКоммерческийПокупка;;
			курс.КурсКоммерческийПродажа = Данные.Шапка.Курс;
		КонецЕсли;
	КонецЕсли; 
	набор.Записать ();	
	
КонецПроцедуры
